In [3]:
import numpy as np

In [4]:
import pandas as pd

we can create arrays as rows and columns, and create column headers as a simple list. 

then we can create a dataframe joining the rows and columns using the pd.DataFrame(data = , columns = ) construct

In [5]:
#so let's create an array, 3,3
new_array = np.array([[3,6,9],[12,15,18], [21, 24, 27]])
headers = ['column 1', 'column 2', 'column 3']
my_dataframe = pd.DataFrame(data = new_array, columns = headers)

In [11]:
print(my_dataframe)

   column 1  column 2  column 3
0         3         6         9
1        12        15        18
2        21        24        27

In [12]:
my_dataframe

   column 1  column 2  column 3
0         3         6         9
1        12        15        18
2        21        24        27

In [13]:
#we can add a new column to the dataframe by putting hte new column name in brackets
my_dataframe['column 4'] = [30, 33, 36]

In [14]:
my_dataframe

   column 1  column 2  column 3  column 4
0         3         6         9        30
1        12        15        18        33
2        21        24        27        36

Task 1

Do the following:
Create an 3x4 (3 rows x 4 columns) pandas DataFrame in which the columns are named Eleanor, Chidi, Tahani, and Jason. Populate each of the 12 cells in the DataFrame with a random integer between 0 and 100, inclusive.
Output the following:
the entire DataFrame
the value in the cell of row #1 of the Eleanor column
Create a fifth column named Janet, which is populated with the row-by-row sums of Tahani and Jason.

In [15]:
names_columns = ['Eleanor', 'Chidi', 'Tahani', 'Jason']
data_for_names = np.random.randint(low = 0, high = 100, size = (3,4))

In [16]:
data_frame = pd.DataFrame(data = data_for_names, columns = names_columns)

In [17]:
#the entire DataFrame
data_frame

   Eleanor  Chidi  Tahani  Jason
0       52     22      55     97
1       56     22       4     85
2       98     79      92      2

In [18]:
#the value in the cell of row #1 of the Eleanor column
data_frame['Eleanor'][0]

52

In [19]:
data_frame['Janet'] = data_frame['Tahani'][:] + data_frame['Jason'][:]
#if jane

In [20]:
data_frame

   Eleanor  Chidi  Tahani  Jason  Janet
0       52     22      55     97    152
1       56     22       4     85     89
2       98     79      92      2     94

In [21]:
#we can copy a dataframe by referencing and setting a variable equal to the dataframe name - but referencing and making changes to one 
#we can use the pd.DataFrame.copy method - which makes a true independent copy

In [22]:
#so in our example we can use 
df = pd.DataFrame.copy(data_frame)

In [23]:
df

   Eleanor  Chidi  Tahani  Jason  Janet
0       52     22      55     97    152
1       56     22       4     85     89
2       98     79      92      2     94

In [26]:
# Create a reference by assigning my_dataframe to a new variable.

reference_df = data_frame
reference_df

   Eleanor  Chidi  Tahani  Jason  Janet
0       52     22      55     97    152
1       56     22       4     85     89
2       98     79      92      2     94

In [35]:
# Print the starting value of a particular cell - lets say Chidi row 0
reference_df['Chidi'][0] #[column][row]
print('The first value under Tahani is %d ' % reference_df['Tahani'][0])

The first value under Tahini is 55

In [38]:
# Modify a cell in df.
reference_df['Tahani'][2] = 4
print(reference_df)
print(data_frame)

   Eleanor  Chidi  Tahani  Jason  Janet
0       52     22      55     97    152
1       56     22       4     85     89
2       98     79       4      2     94
   Eleanor  Chidi  Tahani  Jason  Janet
0       52     22      55     97    152
1       56     22       4     85     89
2       98     79       4      2     94

In [40]:
# Create a true copy of my_dataframe
true_copy_df = pd.DataFrame.copy(data_frame)
data_frame['Jason'][2] = 55 #change one cell 
print(true_copy_df) #print the true copy of the original dataframe
print(data_frame)

#look at the output of what we changed in the true copy vs the original - we retain the values in the true copy

   Eleanor  Chidi  Tahani  Jason  Janet
0       52     22      55     97    152
1       56     22       4     85     89
2       98     79       4     55     94
   Eleanor  Chidi  Tahani  Jason  Janet
0       52     22      55     97    152
1       56     22       4     85     89
2       98     79       4     55     94